Тренировки/src/Documents/Тренировка/Тренировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Тренировка</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаТренировки</name>
    <type>
      <types>CatalogRef.ПрограммыТренировок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Упражнения</name>
    <attributes>
      <name>Упражнение</name>
      <type>
        <types>CatalogRef.Упражнения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подходы</name>
    <attributes>
      <name>Упражнения_ИДСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Повторений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тренировки/src/Documents/Тренировка/Forms/ФормаДокумента/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриЧтенииСозданииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрограммаТренировкиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПрограммаТренировки) И ИнформацияПоТренировке.Количество() = 0 Тогда
		ПрограммаТренировкиПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПрограммаТренировкиПриИзмененииНаСервере()

	 Объект.НомерДня = ПрограммыТренировокСервер.ПолучитьСледующийНомерДняТренировки(Объект.Пользователь, Объект.ПрограммаТренировки);
	 Для Каждого стрУпражнения Из Объект.ПрограммаТренировки.Упражения Цикл
	 	новСтр = ИнформацияПоТренировке.Добавить();
	 	новСтр.Упражнение = стрУпражнения.Упражнение;
	 	новСтр.ИДСтроки = Новый УникальныйИдентификатор();
	 КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ИнформацияПоТренировке_ЗаполнитьПоДаннымДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияПоТренировке_ЗаполнитьПоДаннымДокумента()
	
	ИнформацияПоТренировке.Очистить();
	Для Каждого стрУпражнения Из Объект.Упражнения Цикл
		новСтр = ИнформацияПоТренировке.Добавить();
		ЗаполнитьЗначенияСвойств(новСтр, стрУпражнения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
